/*
SQLyog v10.2 
MySQL - 5.6.24 : Database - springbootdb
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`springbootdb` /*!40100 DEFAULT CHARACTER SET utf8 COLLATE utf8_bin */;

USE `springbootdb`;

/*Table structure for table `t_user` */

DROP TABLE IF EXISTS `t_user`;

CREATE TABLE `t_user` (
  `uid` bigint(32) NOT NULL AUTO_INCREMENT,
  `user_name` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `age` int(20) DEFAULT NULL,
  `address` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=111 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `t_user` */

insert  into `t_user`(`uid`,`user_name`,`age`,`address`) values (2,'章安',12,NULL),(3,'我改的1',11,NULL),(5,'妹妹',16,NULL),(6,'汪涵0',1,'湖南长沙'),(7,'汪涵1',2,'湖南长沙'),(8,'汪涵2',3,'湖南长沙'),(9,'汪涵3',4,'湖南长沙'),(10,'汪涵4',5,'湖南长沙'),(11,'汪涵5',6,'湖南长沙'),(12,'汪涵6',7,'湖南长沙'),(13,'汪涵7',8,'湖南长沙'),(14,'汪涵8',9,'湖南长沙'),(15,'汪涵9',10,'湖南长沙'),(16,'汪涵10',11,'湖南长沙'),(17,'汪涵11',12,'湖南长沙'),(18,'汪涵12',13,'湖南长沙'),(19,'汪涵13',14,'湖南长沙'),(20,'汪涵14',15,'湖南长沙'),(21,'汪涵15',16,'湖南长沙'),(22,'汪涵16',17,'湖南长沙'),(23,'汪涵17',18,'湖南长沙'),(24,'汪涵18',19,'湖南长沙'),(25,'汪涵19',20,'湖南长沙'),(26,'汪涵20',21,'湖南长沙'),(27,'汪涵21',22,'湖南长沙'),(28,'汪涵22',23,'湖南长沙'),(29,'汪涵23',24,'湖南长沙'),(30,'汪涵24',25,'湖南长沙'),(31,'汪涵25',26,'湖南长沙'),(32,'汪涵26',27,'湖南长沙'),(33,'汪涵27',28,'湖南长沙'),(34,'汪涵28',29,'湖南长沙'),(35,'汪涵29',30,'湖南长沙'),(36,'汪涵30',31,'湖南长沙'),(37,'汪涵31',32,'湖南长沙'),(38,'汪涵32',33,'湖南长沙'),(39,'汪涵33',34,'湖南长沙'),(40,'汪涵34',35,'湖南长沙'),(41,'汪涵35',36,'湖南长沙'),(42,'汪涵36',37,'湖南长沙'),(43,'汪涵37',38,'湖南长沙'),(44,'汪涵38',39,'湖南长沙'),(45,'汪涵39',40,'湖南长沙'),(46,'汪涵40',41,'湖南长沙'),(47,'汪涵41',42,'湖南长沙'),(48,'汪涵42',43,'湖南长沙'),(49,'汪涵43',44,'湖南长沙'),(50,'汪涵44',45,'湖南长沙'),(51,'汪涵45',46,'湖南长沙'),(52,'汪涵46',47,'湖南长沙'),(53,'汪涵47',48,'湖南长沙'),(54,'汪涵48',49,'湖南长沙'),(55,'汪涵49',50,'湖南长沙'),(56,'汪涵50',51,'湖南长沙'),(57,'汪涵51',52,'湖南长沙'),(58,'汪涵52',53,'湖南长沙'),(59,'汪涵53',54,'湖南长沙'),(60,'汪涵54',55,'湖南长沙'),(61,'汪涵55',56,'湖南长沙'),(62,'汪涵56',57,'湖南长沙'),(63,'汪涵57',58,'湖南长沙'),(64,'汪涵58',59,'湖南长沙'),(65,'汪涵59',60,'湖南长沙'),(66,'汪涵60',61,'湖南长沙'),(67,'汪涵61',62,'湖南长沙'),(68,'汪涵62',63,'湖南长沙'),(69,'汪涵63',64,'湖南长沙'),(70,'汪涵64',65,'湖南长沙'),(71,'汪涵65',66,'湖南长沙'),(72,'汪涵66',67,'湖南长沙'),(73,'汪涵67',68,'湖南长沙'),(74,'汪涵68',69,'湖南长沙'),(75,'汪涵69',70,'湖南长沙'),(76,'汪涵70',71,'湖南长沙'),(77,'汪涵71',72,'湖南长沙'),(78,'汪涵72',73,'湖南长沙'),(79,'汪涵73',74,'湖南长沙'),(80,'汪涵74',75,'湖南长沙'),(81,'汪涵75',76,'湖南长沙'),(82,'汪涵76',77,'湖南长沙'),(83,'汪涵77',78,'湖南长沙'),(84,'汪涵78',79,'湖南长沙'),(85,'汪涵79',80,'湖南长沙'),(86,'汪涵80',81,'湖南长沙'),(87,'汪涵81',82,'湖南长沙'),(88,'汪涵82',83,'湖南长沙'),(89,'汪涵83',84,'湖南长沙'),(90,'汪涵84',85,'湖南长沙'),(91,'汪涵85',86,'湖南长沙'),(92,'汪涵86',87,'湖南长沙'),(93,'汪涵87',88,'湖南长沙'),(94,'汪涵88',89,'湖南长沙'),(95,'汪涵89',90,'湖南长沙'),(96,'汪涵90',91,'湖南长沙'),(97,'汪涵91',92,'湖南长沙'),(98,'汪涵92',93,'湖南长沙'),(99,'汪涵93',94,'湖南长沙'),(100,'汪涵94',95,'湖南长沙'),(101,'汪涵95',96,'湖南长沙'),(102,'汪涵96',97,'湖南长沙'),(103,'汪涵97',98,'湖南长沙'),(104,'汪涵98',99,'湖南长沙'),(105,'汪涵99',100,'湖南长沙'),(106,'修改往东',30,NULL),(107,'修改往东',30,NULL),(108,'可靠1',111,NULL),(109,'悟空',12,'花果山'),(110,'猪八戒',15,'高老庄');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
